var kalinince = {	
		"A" : 0,
		"a" : 0,
		"Â" : 0,
		"â" : 0,

		"А" : 0,//A
		"а" : 0,//a
		"Ӑ" : 0,//Ӑ
		"ӑ" : 0,//ӑ
		"Ă" : 0,//Ă
		"ă" : 0,//ă

		"E" : 1,
		"e" : 1,

		"Е" : 1,//E
		"е" : 1,//e
		"Э" : 1,//É
		"э" : 1,//é
		"Ә" : 1,//Ä
		"ә" : 1,//ä
		"Ə" : 1,//Ä - Azerbaycan
		"ə" : 1,//ä - Azerbaycan
		"Ӗ" : 1,//Ӗ
		"ӗ" : 1,//ӗ

		"O" : 0,
		"o" : 0,

		"О" : 0,//O
		"о" : 0,//o

		"Ö" : 1,
		"ö" : 1,

		"Ő" : 1, //Ö
		"ő" : 1, //ö

		"Ө" : 1,//Ö
		"ө" : 1,//ö

		"Ѳ" : 1,//Ö - kırgız
		"ѳ" : 1,//ö - kırgız

		"U" : 0,
		"u" : 0,

		"Ұ" : 0,//U
		"ұ" : 0,//u

		"У" : 0,//W
		"у" : 0,//w

		"Ü" : 1,
		"ü" : 1,

		"Ű" : 1, // Ü
		"ű" : 1, // ü

		"Ү" : 1,//Ü
		"ү" : 1,//ü
		"Ӳ" : 1,//Ӳ
		"ӳ" : 1,//ӳ

		"I" : 0,
		"ı" : 0,

		"Ы" : 0,//I
		"ы" : 0,//ı

		"İ" : 1,
		"i" : 1,

		"І" : 1,//İ
		"і" : 1, //i

		"И" : 1,//Ï
		"и" : 1, //ï


// Iran - Arap
		"آ" : 0,//ӗ - İran
		"ا" : 0,//ӗ - İran
// Iran - Arap

};

var unluler = {
		"A" : "&#x10C00;",
		"a" : "&#x10C00;",
		"Â" : "&#x10C00;",
		"â" : "&#x10C00;",

		"А" : "&#x10C00;",//A
		"а" : "&#x10C00;",//a
		"Ә" : "&#x10C00;",//Ä
		"ә" : "&#x10C00;",//ä
		"Ə" : "&#x10C00;",//Ä - Azerbaycan
		"ə" : "&#x10C00;",//ä - Azerbaycan
		"Ӑ" : "&#x10C00;",//Ӑ
		"ӑ" : "&#x10C00;",//ӑ
		"Ă" : "&#x10C00;",//Ă
		"ă" : "&#x10C00;",//ă

		"E" : "&#x10C00;",
		"e" : "&#x10C00;",

		"Е" : "&#x10C00;",//E
		"е" : "&#x10C00;",//e
		"Э" : "&#x10C00;",//É
		"э" : "&#x10C00;",//é
		"Ӗ" : "&#x10C00;",//Ӗ
		"ӗ" : "&#x10C00;",//ӗ

		"I" : "&#x10C03;",
		"ı" : "&#x10C03;",

		"Ы" : "&#x10C03;",//I
		"ы" : "&#x10C03;",//ı

		"İ" : "&#x10C03;",
		"i" : "&#x10C03;",

		"І" : "&#x10C03;",//İ
		"і" : "&#x10C03;",//i

		"И" : "&#x10C03;",//Ï
		"и" : "&#x10C03;",//ï

		"O" : "&#x10C06;",
		"o" : "&#x10C06;",

		"О" : "&#x10C06;",//O
		"о" : "&#x10C06;",//o

		"U" : "&#x10C06;",
		"u" : "&#x10C06;",

		"Ұ" : "&#x10C06;",//U
		"ұ" : "&#x10C06;",//u
		"У" : "&#x10C06;",//V
		"у" : "&#x10C06;",//v


		"Ö" : "&#x10C07;",
		"ö" : "&#x10C07;",

		"Ő" : "&#x10C07;",//Ö Hungar
		"ő" : "&#x10C07;",//ö Hungar

		"Ө" : "&#x10C07;",//Ö
		"ө" : "&#x10C07;",//ö

		"Ѳ" : "&#x10C07;",//Ö - kırgız
		"ѳ" : "&#x10C07;",//ö - kırgız

		"Ü" : "&#x10C07;",
		"ü" : "&#x10C07;",

		"Ű" : "&#x10C07;", // Ü Hungar
		"ű" : "&#x10C07;", // ü Hungar

		"Ӳ" : "&#x10C07;",//Ӳ
		"ӳ" : "&#x10C07;",//ӳ
		"Ү" : "&#x10C07;",//Ü
		"ү" : "&#x10C07;",//ü

// Iran - Arap
		"آ" : "&#x10C00;",//alef-a-ir
		"ا" : "&#x10C00;",//alef-a-ir

		"ی" : "&#x10C03;",//ye-i-y-ir
		"ي" : "&#x10C03;",//ye-i-y-ir
		"ي" : "&#x10C03;",//ye-i-y-ir
		"ی" : "&#x10C03;",//ye-i-y-ir

// Iran - Arap

	  };
	  
	  
var ounluler0 = {
/*		"&#x10C00;" : "a",
		"&#x10C03;" : "ı",
		"&#x10C06;" : "o",
		"&#x10C06;" : "u"
*/	  };   
	  
	  
var ounluler1 = {
/*		"&#x10C00;" : "e",
		"&#x10C03;" : "i",
		"&#x10C07;" : "ö",
		"&#x10C07;" : "ü"
*/	};   
	  

var kalinlar = {  //kalınlar
		"B" : "&#x10C09;",
		"b" : "&#x10C09;",
		"V" : "&#x10C09;",
		"v" : "&#x10C09;",
		"W" : "&#x10C09;",
		"w" : "&#x10C09;",

		"Б" : "&#x10C09;",//B
		"б" : "&#x10C09;",//b
		"В" : "&#x10C09;",//V
		"в" : "&#x10C09;",//v

		"C" : "&#x10C32;",
		"c" : "&#x10C32;",
		"Ç" : "&#x10C32;",
		"ç" : "&#x10C32;",

		"Ч" : "&#x10C32;",//Ç
		"ч" : "&#x10C32;",//ç

		"D" : "&#x10C11;",
		"d" : "&#x10C11;",

		"Д" : "&#x10C11;",//D
		"д" : "&#x10C11;",//d

		"F" : "&#x10C2F;",
		"f" : "&#x10C2F;",

		"Ф" : "&#x10C2F;",//F
		"ф" : "&#x10C2F;",//f

		"G" : "&#x10C0D;",
		"g" : "&#x10C0D;",

		"Г" : "&#x10C0D;",//G
		"г" : "&#x10C0D;",//g

		"Ğ" : "&#x10C0D;",
		"ğ" : "&#x10C0D;",

		"Ғ" : "&#x10C0D;",//Ğ
		"ғ" : "&#x10C0D;",//ğ

		"K" : "&#x10C34;",
		"k" : "&#x10C34;",
		"Q" : "&#x10C34;",
		"q" : "&#x10C34;",
		"H" : "&#x10C34;",
		"h" : "&#x10C34;",
		"X" : "&#x10C34;",
		"x" : "&#x10C34;",

  		"Қ" : "&#x10C34;",//Ka
		"қ" : "&#x10C34;",//ka
		"К" : "&#x10C34;",//K
		"к" : "&#x10C34;",//k
		"Һ" : "&#x10C34;",//H
		"һ" : "&#x10C34;",//h
		"Х" : "&#x10C34;",//HH
		"х" : "&#x10C34;",//HH

		"L" : "&#x10C1E;",
		"l" : "&#x10C1E;",

		"Л" : "&#x10C1E;",//L
		"л" : "&#x10C1E;",//l

		"M" : "&#x10C22;",
		"m" : "&#x10C22;",

		"М" : "&#x10C22;",//M
		"м" : "&#x10C22;",//m

		"N" : "&#x10C23;",
		"n" : "&#x10C23;",

		"Н" : "&#x10C23;",//N
		"н" : "&#x10C23;",//n

		"Ŋ" : "&#x10C2D;",
		"ŋ" : "&#x10C2D;",
		"Ñ" : "&#x10C2D;",
		"ñ" : "&#x10C2D;",

		"Ң" : "&#x10C2D;",//Ŋ
		"ң" : "&#x10C2D;",//ŋ

		"p" : "&#x10C2F;",
		"P" : "&#x10C2F;",

		"П" : "&#x10C2F;",//P
		"п" : "&#x10C2F;",//p

		"R" : "&#x10C3A;",
		"r" : "&#x10C3A;",

		"Р" : "&#x10C3A;",//R
		"р" : "&#x10C3A;",//r

	   	"S" : "&#x10C3D;",
		"s" : "&#x10C3D;",

	   	"С" : "&#x10C3D;",//S
		"с" : "&#x10C3D;",//s

		"Ş" : "&#x10C41;",
		"ş" : "&#x10C41;",

		"Ш" : "&#x10C41;",//Ş
		"ш" : "&#x10C41;",//ş
		"Щ" : "&#x10C41;",//Ş
		"щ" : "&#x10C41;",//ş

		"T" : "&#x10C43;",
		"t" : "&#x10C43;",

		"Т" : "&#x10C43;",//T
		"т" : "&#x10C43;",//t

		"Ц" : "&#x10C43;&#x10C3D;",//TS
		"ц" : "&#x10C43;&#x10C3D;",//ts

		"Y" : "&#x10C16;",
		"y" : "&#x10C16;",
		"J" : "&#x10C16;",
		"j" : "&#x10C16;",

		"Я" : "&#x10C16;&#x10C00;",//YA
		"я" : "&#x10C16;&#x10C00;",//ya
		"Ю" : "&#x10C16;&#x10C06;",//YU
		"ю" : "&#x10C16;&#x10C06;",//yu
		"Ё" : "&#x10C16;&#x10C06;",//YO
		"ё" : "&#x10C16;&#x10C06;",//yo
		"Й" : "&#x10C16;",//Y
		"й" : "&#x10C16;",//y
		"Ж" : "&#x10C16;",//J
		"ж" : "&#x10C16;",//j

		"Z" : "&#x10C14;",
		"z" : "&#x10C14;",

		"З" : "&#x10C14;",//Z
		"з" : "&#x10C14;",//z

// Iran - Arap - kalınlar
		"د" : "&#x10C11;",//dal-d-ir
		"ﺩ" : "&#x10C11;",//dal-d-ir

		"ق" : "&#x10C34;",//qaf-q-ir
		"ق" : "&#x10C34;",//qaf-q-ir
		"ق" : "&#x10C34;",//qaf-q-ir
		"ﻕ" : "&#x10C34;",//qaf-q-ir

		"ک" : "&#x10C1A;",//kaf-k-ir
		"ك" : "&#x10C1A;",//kaf-k-ir
		"ك" : "&#x10C1A;",//kaf-k-ir
		"ک" : "&#x10C1A;",//kaf-k-ir

		"غ" : "&#x10C0D;",//gayn-ğ-ir
		"غ" : "&#x10C0D;",//gayn-ğ-ir
		"ﻏ" : "&#x10C0D;",//gayn-ğ-ir
		"ﻍ" : "&#x10C0D;",//gayn-ğ-ir

		"ف" : "&#x10C2F;",//fe-f-ir
		"ف" : "&#x10C2F;",//fe-f-ir
		"ﻓ" : "&#x10C2F;",//fe-f-ir
		"ﻑ" : "&#x10C2F;",//fe-f-ir

		"ﭻ" : "&#x10C32;",//çe-ç-ir
		"چ" : "&#x10C32;",//çe-ç-ir
		"ﭼ" : "&#x10C32;",//çe-ç-ir
		"ﭺ" : "&#x10C32;",//çe-ç-ir

		"ب" : "&#x10C09;",//be-b-ir
		"ب" : "&#x10C09;",//be-b-ir
		"ﺑ" : "&#x10C09;",//be-b-ir
		"ب" : "&#x10C09;",//be-b-ir

		"و" : "&#x10C09;",//vav-v-ir
		"و" : "&#x10C09;",//vav-v-ir

		"ط" : "&#x10C43;",//ta-t-ir
		"ط" : "&#x10C43;",//ta-t-ir
		"ﻃ" : "&#x10C43;",//ta-t-ir
		"ﻁ" : "&#x10C43;",//ta-t-ir

		"ت" : "&#x10C45;",//te-t-ir
		"ت" : "&#x10C45;",//te-t-ir
		"ﺗ" : "&#x10C45;",//te-t-ir
		"ﺕ" : "&#x10C45;",//te-t-ir

		"ص" : "&#x10C41;",//şad-ş-ir
		"ص" : "&#x10C41;",//şad-ş-ir
		"ﺻ" : "&#x10C41;",//şad-ş-ir
		"ﺹ" : "&#x10C41;",//şad-iş-r

		"پ" : "&#x10C2F;",//pe-p-ir
		"پ" : "&#x10C2F;",//pe-p-ir
		"ﭘ" : "&#x10C2F;",//pe-p-ir
		"پ" : "&#x10C2F;",//pe-p-ir

		"س" : "&#x10C3D;&#x10C03",//sin-s-ir
		"س" : "&#x10C3D;&#x10C03",//sin-s-ir
		"ﺳ" : "&#x10C3D;&#x10C03",//sin-s-ir
		"ﺱ" : "&#x10C3D;&#x10C03",//sin-s-ir

		"ش" : "&#x10C41;",//sin2-ş-ir
		"ش" : "&#x10C41;",//sin2-ş-ir
		"ﺷ" : "&#x10C41;",//sin2-ş-ir
		"ﺵ" : "&#x10C41;",//sin2-ş-ir

		"ث" : "&#x10C3D;",//se-s-ir
		"ث" : "&#x10C3D;",//se-s-ir
		"ﺛ" : "&#x10C3D;",//se-s-ir
		"ﺙ" : "&#x10C3D;",//se-s-ir

		"گ" : "&#x10C0D;",//gaf-g-ir
		"گ" : "&#x10C0D;",//gaf-g-ir
		"ﮔ" : "&#x10C0D;",//gaf-g-ir
		"گ" : "&#x10C0D;",//gaf-g-ir

		"ل" : "&#x10C1E;",//lam-l-ir
		"ل" : "&#x10C1E;",//lam-l-ir
		"ﻟ" : "&#x10C1E;",//lam-l-ir
		"ﻝ" : "&#x10C1E;",//lam-l-ir

		"م" : "&#x10C22;",//mim-m-ir
		"م" : "&#x10C22;",//mim-m-ir
		"ﻣ" : "&#x10C22;",//mim-m-ir
		"ﻡ" : "&#x10C22;",//mim-m-ir

		"ن" : "&#x10C23;",//nun-ir
		"ن" : "&#x10C23;",//nun-ir
		"ﻧ" : "&#x10C23;",//nun-ir
		"ﻥ" : "&#x10C23;",//nun-ir

		"ج" : "&#x10C32;",//jim-c-ir
		"ﺞ" : "&#x10C32;",//jim-c-ir
		"ﺟ" : "&#x10C32;",//jim-c-ir
		"ﺝ" : "&#x10C32;",//jim-c-ir

		"ﺦ" : "&#x10C34;&#x10C0D;",//khe-x-h-ir
		"خ" : "&#x10C34;&#x10C0D;",//khe-x-h-ir
		"ﺧ" : "&#x10C34;&#x10C0D;",//khe-x-h-ir
		"ﺥ" : "&#x10C34;&#x10C0D;",//khe-x-h-ir

		"ه" : "&#x10C34;",//hye-h-ir
		"ه" : "&#x10C34;",//hye-h-ir
		"ه" : "&#x10C34;",//hye-h-ir
		"ﻩ" : "&#x10C34;",//hye-h-ir

		"ﺢ" : "&#x10C34;",//hje-h-ir
		"ح" : "&#x10C34;",//hje-h-ir
		"ﺣ" : "&#x10C34;",//hje-h-ir
		"ﺡ" : "&#x10C34;",//hje-h-ir

		"ع" : "&#x10C34;",//eyn-hyu-ir
		"ع" : "&#x10C34;",//eyn-hyu-ir
		"ﻋ" : "&#x10C34;",//eyn-hyu-ir
		"ﻉ" : "&#x10C34;",//eyn-hyu-ir

		"ر" : "&#x10C3A;",//re-r-ir
		"ﺭ" : "&#x10C3A;",//re-r-ir

		"ظ" : "&#x10C14;",//za-ir
		"ظ" : "&#x10C14;",//za-ir
		"ﻇ" : "&#x10C14;",//za-ir
		"ﻅ" : "&#x10C14;",//za-ir

		"ض" : "&#x10C14;",//zad-ir
		"ض" : "&#x10C14;",//zad-ir
		"ﺿ" : "&#x10C14;",//zad-ir
		"ﺽ" : "&#x10C14;",//zad-ir

		"ذ" : "&#x10C14;",//zal-z-ir
		"ﺫ" : "&#x10C14;",//zal-z-ir

		"ز" : "&#x10C14;",//ze-z-ir
		"ﺯ" : "&#x10C14;",//ze-z-ir

		"ژ" : "&#x10C14;",//že-z-ir
		"ژ" : "&#x10C14;",//že-z-ir
// Iran - Arap
	  }; // kalınlar biter
	  
var suz = {
/*
		"Ş" : "&#x10C41;",
		"ş" : "&#x10C41;",
		"J" : "&#x10C41;",
		"j" : "&#x10C41;",
*/	};
	  
	var osuz = {
/*		"&#x10C32;" : "ç",
		"&#x10C22;" : "m",
		"&#x10C2F;" : "p",
		"&#x10C41;" : "ş",
		"&#x10C15;" : "z",
		"&#x10C2D;" : "ŋ"
*/	  };  
	  
	  
var inceler = {  // inceler başlar
		"B" : "&#x10C0B;",
		"b" : "&#x10C0B;",
		"V" : "&#x10C0B;",
		"v" : "&#x10C0B;",
		"W" : "&#x10C0B;",
		"w" : "&#x10C0B;",

		"Б" : "&#x10C0B;",//B
		"б" : "&#x10C0B;",//b
		"В" : "&#x10C0B;",//V
		"в" : "&#x10C0B;",//v

		"C" : "&#x10C32;",
		"c" : "&#x10C32;",
		"Ç" : "&#x10C32;",
		"ç" : "&#x10C32;",

		"Ч" : "&#x10C32;",//Ç
		"ч" : "&#x10C32;",//ç

		"D" : "&#x10C13;",
		"d" : "&#x10C13;",

		"Д" : "&#x10C13;",//D
		"д" : "&#x10C13;",//d

		"F" : "&#x10C2F;",
		"f" : "&#x10C2F;",

		"Ф" : "&#x10C2F;",//F
		"ф" : "&#x10C2F;",//f

		"G" : "&#x10C0F;",
		"g" : "&#x10C0F;",
		"Ğ" : "&#x10C0F;",
		"ğ" : "&#x10C0F;",

		"Г" : "&#x10C0F;",//G
		"г" : "&#x10C0F;",//g
		"Ғ" : "&#x10C0F;",//Ğ
		"ғ" : "&#x10C0F;",//ğ

		"K" : "&#x10C1A;",
		"k" : "&#x10C1A;",
		"Q" : "&#x10C34;",
		"q" : "&#x10C34;",
		"H" : "&#x10C1A;",
		"h" : "&#x10C1A;",
		"X" : "&#x10C1A;",
		"x" : "&#x10C1A;",

  		"Қ" : "&#x10C34;",//Ka
		"қ" : "&#x10C34;",//ka
		"К" : "&#x10C1A;",//Ke
		"к" : "&#x10C1A;",//ke
		"Һ" : "&#x10C1A;",//He
		"һ" : "&#x10C1A;",//he
		"Х" : "&#x10C34;",//Ha
		"х" : "&#x10C34;",//ha

		"L" : "&#x10C20;",
		"l" : "&#x10C20;",

		"Л" : "&#x10C20;",//L
		"л" : "&#x10C20;",//l

		"M" : "&#x10C22;",
		"m" : "&#x10C22;",

		"М" : "&#x10C22;",//M
		"м" : "&#x10C22;",//m

		"N" : "&#x10C24;",
		"n" : "&#x10C24;",

		"Н" : "&#x10C24;",//N
		"н" : "&#x10C24;",//n

		"Ŋ" : "&#x10C2D;",
		"ŋ" : "&#x10C2D;",
		"Ñ" : "&#x10C2D;",
		"ñ" : "&#x10C2D;",

		"Ң" : "&#x10C2D;",//Ŋ
		"ң" : "&#x10C2D;",//ŋ

		"p" : "&#x10C2F;",
		"P" : "&#x10C2F;",

		"П" : "&#x10C2F;",//P
		"п" : "&#x10C2F;",//p

		"R" : "&#x10C3C;",
		"r" : "&#x10C3C;",

		"Р" : "&#x10C3C;",//R
		"р" : "&#x10C3C;",//r

		"S" : "&#x10C3E;",
		"s" : "&#x10C3E;",

		"С" : "&#x10C3E;",//S
		"с" : "&#x10C3E;",//s

		"Ş" : "&#x10C41;",
		"ş" : "&#x10C41;",

		"Ш" : "&#x10C41;",//Ş
		"ш" : "&#x10C41;",//ş
		"Щ" : "&#x10C41;",//Ş
		"щ" : "&#x10C41;",//ş

		"T" : "&#x10C45;",
		"t" : "&#x10C45;",

		"Т" : "&#x10C45;",//T
		"т" : "&#x10C45;",//t

		"Ц" : "&#x10C45;&#x10C3E;",//TS
		"ц" : "&#x10C45;&#x10C3E;",//ts

		"Y" : "&#x10C18;",
		"y" : "&#x10C18;",
		"J" : "&#x10C18;",
		"j" : "&#x10C18;",

		"Я" : "&#x10C16;&#x10C00;",//YA
		"я" : "&#x10C16;&#x10C00;",//ya
		"Ю" : "&#x10C16;&#x10C06;",//YU
		"ю" : "&#x10C16;&#x10C06;",//yu
		"Ё" : "&#x10C16;&#x10C06;",//YO
		"ё" : "&#x10C16;&#x10C06;",//yo
		"Й" : "&#x10C18;",//Y
		"й" : "&#x10C18;",//y
		"Ж" : "&#x10C18;",//J
		"ж" : "&#x10C18;",//j

		"Z" : "&#x10C14;",
		"z" : "&#x10C14;",

		"З" : "&#x10C14;",//Z
		"з" : "&#x10C14;", //z

// Iran - Arap - inceler
		"د" : "&#x10C13;",//dal-d-ir
		"ﺩ" : "&#x10C13;",//dal-d-ir

		"ق" : "&#x10C34;",//qaf-q-ir
		"ق" : "&#x10C34;",//qaf-q-ir
		"ق" : "&#x10C34;",//qaf-q-ir
		"ﻕ" : "&#x10C34;",//qaf-q-ir

		"ک" : "&#x10C1A;",//kaf-k-ir
		"ك" : "&#x10C1A;",//kaf-k-ir
		"ك" : "&#x10C1A;",//kaf-k-ir
		"ک" : "&#x10C1A;",//kaf-k-ir

		"غ" : "&#x10C0F;",//gayn-ğ-ir
		"غ" : "&#x10C0F;",//gayn-ğ-ir
		"ﻏ" : "&#x10C0F;",//gayn-ğ-ir
		"ﻍ" : "&#x10C0F;",//gayn-ğ-ir

		"ف" : "&#x10C2F;",//fe-f-ir
		"ف" : "&#x10C2F;",//fe-f-ir
		"ﻓ" : "&#x10C2F;",//fe-f-ir
		"ﻑ" : "&#x10C2F;",//fe-f-ir

		"ﭻ" : "&#x10C32;",//çe-ç-ir
		"چ" : "&#x10C32;",//çe-ç-ir
		"ﭼ" : "&#x10C32;",//çe-ç-ir
		"ﭺ" : "&#x10C32;",//çe-ç-ir

		"ب" : "&#x10C0B;",//be-ir
		"ب" : "&#x10C0B;",//be-ir
		"ﺑ" : "&#x10C0B;",//be-ir
		"ب" : "&#x10C0B;",//be-ir

		"و" : "&#x10C0B;",//vav-v-ir
		"و" : "&#x10C0B;",//vav-v-ir

		"ط" : "&#x10C43;",//ta-t-ir
		"ط" : "&#x10C43;",//ta-t-ir
		"ﻃ" : "&#x10C43;",//ta-t-ir
		"ﻁ" : "&#x10C43;",//ta-t-ir

		"ت" : "&#x10C45;",//te-t-ir
		"ت" : "&#x10C45;",//te-t-ir
		"ﺗ" : "&#x10C45;",//te-t-ir
		"ﺕ" : "&#x10C45;",//te-t-ir

		"ص" : "&#x10C41;",//şad-ş-ir
		"ص" : "&#x10C41;",//şad-ş-ir
		"ﺻ" : "&#x10C41;",//şad-ş-ir
		"ﺹ" : "&#x10C41;",//şad-ş-ir

		"پ" : "&#x10C2F;",//pe-ir
		"پ" : "&#x10C2F;",//pe-ir
		"ﭘ" : "&#x10C2F;",//pe-ir
		"پ" : "&#x10C2F;",//pe-ir

		"س" : "&#x10C3E;&#x10C03",//sin-s-ir
		"س" : "&#x10C3E;&#x10C03",//sin-s-ir
		"ﺳ" : "&#x10C3E;&#x10C03",//sin-s-ir
		"ﺱ" : "&#x10C3E;&#x10C03",//sin-s-ir

		"ش" : "&#x10C41;",//sin2-ş-ir
		"ش" : "&#x10C41;",//sin2-ş-ir
		"ﺷ" : "&#x10C41;",//sin2-ş-ir
		"ﺵ" : "&#x10C41;",//sin2-ş-ir

		"ث" : "&#x10C3E;",//se-s-ir
		"ث" : "&#x10C3E;",//se-s-ir
		"ﺛ" : "&#x10C3E;",//se-s-ir
		"ﺙ" : "&#x10C3E;",//se-s-ir

		"گ" : "&#x10C13;",//gaf-ir
		"گ" : "&#x10C13;",//gaf-ir
		"ﮔ" : "&#x10C13;",//gaf-ir
		"گ" : "&#x10C13;",//gaf-ir

		"ل" : "&#x10C20;",//lam-l-ir
		"ل" : "&#x10C20;",//lam-l-ir
		"ﻟ" : "&#x10C20;",//lam-l-ir
		"ﻝ" : "&#x10C20;",//lam-l-ir

		"م" : "&#x10C22;&#x10C0F;",//mim-m-ir
		"م" : "&#x10C22;&#x10C0F;",//mim-m-ir
		"ﻣ" : "&#x10C22;&#x10C0F;",//mim-m-ir
		"ﻡ" : "&#x10C22;&#x10C0F;",//mim-m-ir

		"ﺦ" : "&#x10C1A;",//khe-x-h-ir
		"خ" : "&#x10C1A;",//khe-x-h-ir
		"ﺧ" : "&#x10C1A;",//khe-x-h-ir
		"ﺥ" : "&#x10C1A;",//khe-x-h-ir

		"ه" : "&#x10C1A;",//hye-h-ir
		"ه" : "&#x10C1A;",//hye-h-ir
		"ه" : "&#x10C1A;",//hye-h-ir
		"ﻩ" : "&#x10C1A;",//hye-h-ir

		"ﺢ" : "&#x10C1A;",//hje-h-ir
		"ح" : "&#x10C1A;",//hje-h-ir
		"ﺣ" : "&#x10C1A;",//hje-h-ir
		"ﺡ" : "&#x10C1A;",//hje-h-ir

		"ع" : "&#x10C34;",//eyn-hyu-ir
		"ع" : "&#x10C34;",//eyn-hyu-ir
		"ﻋ" : "&#x10C34;",//eyn-hyu-ir
		"ﻉ" : "&#x10C34;",//eyn-hyu-ir

		"ن" : "&#x10C24;",//nu-n-ir
		"ن" : "&#x10C24;",//nun-n-ir
		"ﻧ" : "&#x10C24;",//nun-n-ir
		"ﻥ" : "&#x10C24;",//nun-n-ir

		"ج" : "&#x10C32;",//jim-c-ir
		"ﺞ" : "&#x10C32;",//jim-c-ir
		"ﺟ" : "&#x10C32;",//jim-c-ir
		"ﺝ" : "&#x10C32;",//jim-c-ir

		"ر" : "&#x10C3C;",//re-r-ir
		"ﺭ" : "&#x10C3C;",//re-r-ir

		"ظ" : "&#x10C14;",//za-z-ir
		"ظ" : "&#x10C14;",//za-z-ir
		"ﻇ" : "&#x10C14;",//za-z-ir
		"ﻅ" : "&#x10C14;",//za-z-ir

		"ض" : "&#x10C14;",//zad-z-ir
		"ض" : "&#x10C14;",//zad-z-ir
		"ﺿ" : "&#x10C14;",//zad-z-ir
		"ﺽ" : "&#x10C14;",//zad-z-ir

		"ذ" : "&#x10C14;",//zal-z-ir
		"ﺫ" : "&#x10C14;",//zal-z-ir

		"ز" : "&#x10C14;",//ze-z-ir
		"ﺯ" : "&#x10C14;",//ze-z-ir

		"ژ" : "&#x10C14;",//že-z-ir
		"ژ" : "&#x10C14;",//že-z-ir

// Iran - Arap
	  }; // inceler biter
	  
function strToArr(str) {
	   charList = str.split('');

	   return charList;

}

function chtohx(input) {
	function pad_four(input) {
		var l = input.length;
		if (l == 0) return '00000';
		if (l == 1) return '0000' + input;
		if (l == 2) return '000' + input;
		if (l == 3) return '00' + input;
		if (l == 4) return '0' + input;
		return input;
	}
	var output = '';
	for (var i = 0, l = input.length; i < l; i++)
		output += pad_four('&#' + input.charCodeAt(i).toString(16))+';';
	return output;
}

function lto(str)
	  {
		var ret = "";
		var chra = strToArr(str);
		sz = chra.length;
		//print $sz;
		
		var lki = 0;
		
		for(var i=0; i<sz; i++){
		
		//print $i;
		var ch = chra[i];
		var chn;

		if(i<=sz-1)
		chn = chra[i+1];
		else
		chn = "";

		if(ch == "\n")
				{
				 ret = ret + " .";
			continue;
				 }
			   if(ch == " ")
				{
				 ret = ret + " ";
			continue;
				 }
				
 				if (ch in unluler)
			{
				
				ret = ret+unluler[ch];
				
				lki = kalinince[ch];
				
				continue;
				
			}

			else if(ch in inceler)
			{
			
				if(chn in kalinince)
				{

					cs = kalinince[chn];
					if(cs == 1)
					ret = ret+inceler[ch]+unluler[chn];

					else if(cs == 0)
					ret = ret+kalinlar[ch]+unluler[chn];
					
					
					i++;
					lki=cs;
					
					continue;
					
				}
				else
				{	if(lki == 1)
					ret = ret+inceler[ch];
				
					if(lki == 0)
					ret = ret+kalinlar[ch];
				
				}
				
			}
			else
			{
			//
			//prif";
			}
			
			
		
		
		//print $ret;
		}
		
		
		return ret;
		  
		  
	  }


